cavity-curve/system/blockMeshDict
/--------------------------------- C++ -----------------------------------\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\---------------------------------------------------------------------------/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

dx1     0;
dx2     2.5;
dx3     7.5;
dx4     10;

dz1     -2.5;
dz2      2.5;

dy1      0;
dy2      2;



vertices
(
    //vertices da face esquerda
    ($dx1 $dy1 $dz1) // 0
    ($dx2 $dy1 $dz1) // 1
    ($dx3 $dy1 $dz1) // 2
    ($dx4 $dy1 $dz1) // 3
    
    ($dx4 $dy2 $dz1) // 4
    ($dx3 $dy2 $dz1) // 5
    ($dx2 $dy2 $dz1) // 6
    ($dx1 $dy2 $dz1) // 7

//vertices da face direita
    ($dx1 $dy1 $dz2) // 8
    ($dx2 $dy1 $dz2) // 9
    ($dx3 $dy1 $dz2) // 10
    ($dx4 $dy1 $dz2) // 11
    
    ($dx4 $dy2 $dz2) // 12
    ($dx3 $dy2 $dz2) // 13
    ($dx2 $dy2 $dz2) // 14
    ($dx1 $dy2 $dz2) // 15
    
    
);

blocks
(
    hex (0 1 6 7 8 9 14 15) (20 10 10) simpleGrading (1 1 1)
    hex (1 2 5 6 9 10 13 14) (20 10 10) simpleGrading (1 1 1)
    hex (2 3 4 5 10 11 12 13) (20 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet //entrada
    {
        type patch;
        faces
        (
            (0 8 15 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 11 12 4)

        );
    }
    walls
    {
        type wall;
        faces
        (
            (7 15 14 6)  // top
            (5 13 12 4)  // top
            (0 1 9 8)    //bottom 
            (2 3 11 10)  //bottom
            (0 7 6 1)     // left        
            (2 5 4 3)     // left
            (9 14 15 8) //right
            (11 12 13 10) //right
        );
    }
    
    cold_wall
    {
        type wall;
        faces
        (
            (2 10 9 1)  // bottom
            (5 6 14 13)  //top 
            (1 6 5 2)  //left
            (10 9 14 13) // right

        );
    }
    
    
);

mergePatchPairs
(
);

// ************************* //